# Ultralytics YOLOv8 with BiFPN (yolov8n_bifpn.yaml)

# Parameters
nc: &nc 2  # Number of classes
depth_multiple: 0.33  # Model depth multiple
width_multiple: 0.50  # Model width multiple
feature_size: &feature_size 64    # Feature size for BiFPN layers
num_layers: &num_layers 2       # Number of BiFPN layers
epsilon: 0.0001

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv8.0n head with BiFPN
head:
  # BiFPN (Takes P3, P4, P5 from backbone)
  - [[3, 5, 7], 1, BiFPN, [256, 512, 1024, *feature_size, *num_layers]]

  # Post-BiFPN Processing:
  - [10, 1, Conv, [256, 1, 1]]
  - [-1, 3, C2f, [256, False]]
  - [10, 1, Conv, [512, 1, 1]]
  - [-1, 3, C2f, [512, False]]
  - [10, 1, Conv, [1024, 1, 1]]
  - [-1, 3, C2f, [1024, False]]

  # Detect Layer:
  - [[12, 14, 16], 1, Detect, [*nc]]
