# Ultralytics YOLOv8 with BiFPN (yolov8n_bifpn.yaml)

# Parameters 
nc: 2  # number of classes
scales:
  n: [0.33, 0.5, 1024]
feature_size: 64  # Feature size for BiFPN layers
num_layers: 2     # Number of BiFPN layers
epsilon: 0.0001

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head with BiFPN
head:
  - ["3,5,7", 1, BiFPN, []]   # 10: BiFPN (P3, P4, P5 in)

  - [10, 1, Conv, [256, 1, 1]]  # 11: P3 from BiFPN (index 0)
  - [10, 1, Conv, [512, 1, 1]]  # 12: P4 from BiFPN (index 1)
  - [10, 1, Conv, [1024, 1, 1]] # 13: P5 from BiFPN (index 2)

  - [[11, 12, 13], 1, Detect, [nc]]  # Detect(P3, P4, P5)
