# Model Parameters
nc: 2  # Adjust as needed
strides: [8, 16, 32]  # Output strides
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, ['efficientnet_b3', DEFAULT, True, 2, True]]  # 0 (B, list with final feature: 1536 channels at H/32)
  - [0, 1, Index, [48, 4]]     # 1 - P3/8  (B, 48, 80, 80)
  - [0, 1, Index, [136, 6]]    # 2 - P4/16 (B, 136, 40, 40)
  - [0, 1, Index, [1536, 9]]   # 3 - P5/32 (B, 1536, 20, 20)
  - [-1, 1, SPPF, [1536, 5]]   # 4 - P5/32 (B, 1536, 20, 20)

head:
  # [from, repeats, module, args]

  # --- FPN (Top-Down) Pathway ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5
  - [[-1, 2], 1, Concat, [1]]                 # 6
  - [-1, 3, C2f, [136, True]]                  # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8
  - [[-1, 1], 1, Concat, [1]]                 # 9
  - [-1, 3, C2f, [48, True]]                   # 10

  # --- PANet (Bottom-Up) Pathway ---
  - [-1, 1, Conv, [48, 3, 2]]                   # 11
  - [[-1, 7], 1, Concat, [1]]                  # 12
  - [-1, 3, C2f, [136, True]]                  # 13

  - [-1, 1, Conv, [136, 3, 2]]                  # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15 - CHANGED:  We're going to force this to output 384
  - [-1, 3, C2f, [1536, True]]                  # 16

  # --- Detection Head ---
  - [[10, 13, 16], 1, Detect, [nc]]              # 17
