# Ultralytics YOLOv8 with BiFPN (yolov8n_bifpn.yaml)
# Corrected version maintaining compatibility

# Parameters
nc: &nc 2                    # Number of classes
depth_multiple: 0.33         # Model depth multiple
width_multiple: 0.50         # Model width multiple
bifpn_feature_size: &bifpn_fs 64  # Feature size for BiFPN
bifpn_num_layers: &bifpn_nl 2     # Number of BiFPN layers
epsilon: 0.0001

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]     # 9

# YOLOv8.0n head with BiFPN
head:
  # BiFPN Neck (Takes P3(3), P4(5), P5(7) from backbone)
  - [[3, 5, 7], 1, BiFPN, [256, 512, 1024, *bifpn_fs, *bifpn_nl, epsilon]]  # 10

  # Post-BiFPN Processing
  - [-1, 1, Conv, [256, 3, 2]]   # 11-P3/8
  - [-1, 3, C2f, [256]]          # 12
  - [-1, 1, Conv, [512, 3, 2]]   # 13-P4/16
  - [-1, 3, C2f, [512]]          # 14
  - [-1, 1, Conv, [1024, 3, 2]]  # 15-P5/32
  - [-1, 3, C2f, [1024]]         # 16

  # Detect Layer
  - [[12, 14, 16], 1, Detect, [*nc]]  # 17
