# Ultralytics YOLOv8 with BiFPN (yolov8n_bifpn.yaml)

# Parameters (same as yolov8n.yaml, adjust as needed)
nc: 2  # number of classes
scales:
  n: [0.33, 0.5, 1024]

# YOLOv8.0n backbone (same as yolov8n.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head with BiFPN (Modified)
head:
  - [15, 1, Conv, [256, 1, 1]]   # 15: P3 from BiFPN, adjusted channels
  - [18, 1, Conv, [512, 1, 1]]   # 18: P4 from BiFPN, adjusted channels
  - [21, 1, Conv, [1024, 1, 1]]  # 21: P5 from BiFPN, adjusted channels
  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
