# Ultralytics YOLOv8 with BiFPN (yolov8n_bifpn.yaml)

# Parameters
nc: 2  # Number of classes
depth_multiple: 0.33  # Model depth multiple (for scaling, if needed)
width_multiple: 0.50  # Model width multiple (for scaling, if needed)
feature_size: 64    # Feature size for BiFPN layers
num_layers: 2       # Number of BiFPN layers
epsilon: 0.0001

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32  <-- Updated to 1024
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head with BiFPN
head:
  # BiFPN (Takes P3, P4, P5 from backbone)
  - [[3, 5, 7], 1, BiFPN, [256, 512, 1024, feature_size, num_layers]]  # 10: BiFPN

  # --- Post-BiFPN Processing (Crucial) ---
  # Process P3 from BiFPN (index 0 of BiFPN output)
  - [10, 1, Conv, [256, 1, 1]]   # 11: 1x1 conv on P3
  - [-1, 3, C2f, [256, False]]     # 12: C2f on P3

  # Process P4 from BiFPN (index 1 of BiFPN output)
  - [10, 1, Conv, [512, 1, 1]]   # 13: 1x1 conv on P4
  - [-1, 3, C2f, [512, False]]     # 14: C2f on P4

  # Process P5 from BiFPN (index 2 of BiFPN output)
  - [10, 1, Conv, [1024, 1, 1]]   # 15: 1x1 conv on P5
  - [-1, 3, C2f, [1024, False]]     # 16: C2f on P5

  # Detect Layer (takes refined P3, P4, P5)
  - [[12, 14, 16], 1, Detect, [nc]]  # Detect(P3, P4, P5)
